"use client";

import theme from "@/app/theme";
import {
  Container,
  SimpleGrid,
  Image,
  Center,
  Title,
  Text,
  List,
  ThemeIcon,
  rem,
  Card,
  Badge,
  Group,
  Box,
} from "@mantine/core";
import {
  IconCircleCheck,
  IconCircleDashed,
  IconCookie,
  IconGauge,
  IconUser,
} from "@tabler/icons-react";

export function AboutMe() {
  return (
    <Container h={"100%"} fluid p={0}>
      <SimpleGrid cols={{ md: 2, sm: 1 }}>
        <Box bg={"brand"}>
          <Center>
            <Title order={1}>ABOUT ME 👨‍💻</Title>
          </Center>
          <Text mb="md" p={"md"}>
            สวัสดีครับ ผมเป็นผู้สำเร็จการศึกษาจากสถาบันการอาชีวศึกษาภาคใต้ 3
            ในสาขาวิชาเทคโนโลยีสารสนเทศ
            ผมมีความภูมิใจที่ได้เรียนรู้และพัฒนาตนเองในสาขานี้
            ซึ่งเป็นสาขาที่ผมหลงใหลและมีความสนใจเป็นอย่างยิ่ง
            นอกจากความรู้ทางด้านทฤษฎีแล้ว
            ผมยังได้รับโอกาสในการฝึกปฏิบัติและเสริมสร้างทักษะผ่านการทำงานจริงในหลากหลายโครงการตลอดระยะเวลา
            1 ปี 2 เดือนที่ผ่านมา ในช่วงเวลาที่ผมทำงาน
            ผมมีโอกาสได้เข้าร่วมและมีบทบาทสำคัญในโครงการที่หลากหลาย
            ไม่ว่าจะเป็นการพัฒนาเว็บไซต์ แอปพลิเคชันบนมือถือ
            และระบบสารสนเทศต่างๆ ซึ่งทุกโครงการที่ผมได้มีส่วนร่วม
            ได้เสริมสร้างทักษะในการเขียนโปรแกรม การแก้ไขปัญหาที่ซับซ้อน
            และการทำงานร่วมกับทีมงานที่มีความสามารถ
            ผมได้เรียนรู้วิธีการสื่อสารที่มีประสิทธิภาพ การประสานงาน
            และการจัดการเวลา เพื่อให้โครงการต่างๆ
            สำเร็จลุล่วงตามกำหนดเวลาและมาตรฐานที่ตั้งไว้ นอกจากนี้
            ผมยังตระหนักถึงความสำคัญของการเรียนรู้และพัฒนาตนเองอย่างต่อเนื่อง
            เพื่อให้ทันกับการเปลี่ยนแปลงของเทคโนโลยีที่รวดเร็ว
            ผมจึงมักจะใช้เวลาในการศึกษาและทดลองใช้เทคโนโลยีใหม่ๆ อยู่เสมอ
            ไม่ว่าจะเป็นการเรียนรู้ภาษาโปรแกรมใหม่ๆ
            การศึกษาแนวคิดและวิธีการที่เป็นปัจจุบัน
            รวมถึงการเข้าร่วมสัมมนาและการฝึกอบรมที่เกี่ยวข้อง
            ซึ่งช่วยให้ผมสามารถนำความรู้ที่ได้รับมาใช้ในการพัฒนางานของผมให้มีคุณภาพและประสิทธิภาพมากยิ่งขึ้น
          </Text>
        </Box>
        <Box pr={"md"} mt={"sm"}>
          <Image radius="md" h={400} src="/profile.jpg" alt="profile" />
        </Box>
      </SimpleGrid>
    </Container>
  );
}
